[
	{
		"id":0,
		"name":"Feary Wivern",
		"description":"Um VTT construído inteiramente para meu próprio sistema de RPG. Ele está sendo feito em React e C#",
		"content":[
			{
				"img":false,
				"text":"Comecei este projeto no incio do ano de 2023, acabei apagando ele do meu github ao perceber que ele estava completamente ineficiente. Passei, então a estudar C# para desenvolver um Back-end em .NET para este projeto, ainda estou no começo, mas voltei a focar em desenvolver. logo haverá mais sobre ele aqui."
			},
			{
				"img":false,
				"text":"Logo haverá mais sobre ele aqui."
			}
		]
	},
	{
		"id":1,
		"name":"Mista Lista",
		"description":"Esse projeto é mais um aprendizado e uma organização das compras familiares.",
		"content":[
			{
				"img":false,
				"text":"No inicio de 2023 eu usei React Native para criar um app de lista de compras para meus pais, eles adoraram, e logo deram varias sugestões para ficar ainda melhor. Inicialmente ele era assim:"
			},{
				"img":true,
				"text":"https://i.ibb.co/RjZnnNk/Mista-lista-v1.jpg"
			},{
				"img":false,
				"text":"Era nada mais que uma longa lista de itens retirados de um tabela, era possível dizer que o item já havia sido pego no botão OK, ele então era deletado da tabela. Na caixa abaixo ficam três inputs para informar o nome do item, a quantidade e adiciona-lo a tabela."
			},
			{
				"img":false,
				"text":"Como sempre quis estudar Flutter, então comecei a fazer isso para desenvolver um nova versão do app, com todas as sugestões de melhorias que foram feitas."
			},
			{
				"img":false,
				"text":"A ideia é muito simples, o app funciona apenas lendo uma tabela no Supabase e permitindo gravar nela, a ideia é que todas as pessoas com o app possam ver e alterar a mesma tabela. Assim todos os moradores da minha casa podem adicionar a uma lista de compras em conjunto."
			},
			{
				"img":false,
				"text":"Comecei a desenvolver essa nova versão um pouco antes de  começar este portfolio, então imagino que os primeiros posts no blog serão sobre meu aprendizado em Flutter e desenvolvimento dele"
			}	
		]
	}
]